app/views/lines/_form.html.erb

 <%= f.label :municipio %><br />
 <%= collection_select(:line, :municipio_id, Municipio.all, :id, :nombre, {:prompt => false}) %>
---
SELECT "municipios".* FROM "municipios"