app/views/inspection_lines/_form.html.erb

SELECT "inspections".* FROM "inspections"
SELECT "lines".* FROM "lines"
---
  <%= f.label :procedure %><br>
  <%= collection_select(:inspection_line, :inspection_id, Inspection.all, :id, :nombre, {:prompt => false}) %>