app/views/inspection_lines/index.html.erb

        <td>id: <%= inspection_line.id %></td>
        <td><%= Inspection.find(inspection_line.inspection_id).nombre %></td>
        <td><%= Line.find(inspection_line.line_id).nombre %></td>
---
SELECT  "inspections".* FROM "inspections"  WHERE "inspections"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "lines".* FROM "lines"  WHERE "lines"."id" = ? LIMIT 1  [["id", 1]]