app/views/inspection_lines/show.html.erb

SELECT  "inspections".* FROM "inspections"  WHERE "inspections"."id" = ? LIMIT 1  [["id", 1]]
---
  <strong>Nombre:</strong>
  <%= Inspection.find(@inspection_line.inspection_id).nombre %>

SELECT  "lines".* FROM "lines"  WHERE "lines"."id" = ? LIMIT 1  [["id", 1]]
---
  <strong>Nombre:</strong>
 <%= Line.find(@inspection_line.line_id).nombre %>