app/views/dependencies/_form.html.erb

SELECT "municipios".* FROM "municipios"
---
 <%= f.label :municipio %><br />
 <%= collection_select(:dependency, :municipio_id, Municipio.all, :id, :nombre, {:prompt => false}) %>