app/views/imcos/index.html.erb

SELECT "municipios".* FROM "municipios"
---
						<BR>
						<%= f.select :municipio, Municipio.all.map { |u| [u.nombre, u.id] },{ include_blank: true }, { class: 'chosen-select' }%>