app/views/imcos/tramite.html.erb

SELECT "lines".* FROM "lines"  WHERE "lines"."dependency_id" = 1
---
    <%= f.label :lines %><br>
     <%= collection_select(:lines, :line_id, Line.where(dependency_id: 1), :id, :nombre, {:prompt => false}) %>