app/views/procedure_requirements/index.html.erb

SELECT  "procedures".* FROM "procedures"  WHERE "procedures"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "requirements".* FROM "requirements"  WHERE "requirements"."id" = ? LIMIT 1  [["id", 1]]
---
        <td>id: <%= procedure_requirement.id %></td>
        <td><%= Procedure.find(procedure_requirement.procedure_id).nombre %></td>
        <td><%= Requirement.find(procedure_requirement.requirement_id).nombre %></td>