app/views/procedure_requirements/show.html.erb

SELECT  "procedures".* FROM "procedures"  WHERE "procedures"."id" = ? LIMIT 1  [["id", 1]]
---
  <strong>Nombre:</strong>
  <%= Procedure.find(@procedure_requirement.procedure_id).nombre %>

SELECT  "requirements".* FROM "requirements"  WHERE "requirements"."id" = ? LIMIT 1  [["id", 1]]
---
  <strong>Nombre:</strong>
 <%= Requirement.find(@procedure_requirement.requirement_id).nombre %>