app/views/procedure_lines/_form.html.erb

SELECT "lines".* FROM "lines"
SELECT "procedures".* FROM "procedures"
---
  <%= f.label :procedure %><br>
  <%= collection_select(:procedure_line, :procedure_id, Procedure.all, :id, :nombre, {:prompt => false}) %>