app/views/procedure_lines/index.html.erb

SELECT  "procedures".* FROM "procedures"  WHERE "procedures"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "lines".* FROM "lines"  WHERE "lines"."id" = ? LIMIT 1  [["id", 1]]
---
        <td>id: <%= procedure_line.id %></td>
        <td><%= Procedure.find(procedure_line.procedure_id).nombre %></td>
        <td><%= Line.find(procedure_line.line_id).nombre %></td>