app/views/procedure_lines/show.html.erb

SELECT  "procedures".* FROM "procedures"  WHERE "procedures"."id" = ? LIMIT 1  [["id", 2]]
---
  <strong>Procedure:</strong>
  <%= Procedure.find(@procedure_line.procedure_id).nombre %>

SELECT  "lines".* FROM "lines"  WHERE "lines"."id" = ? LIMIT 1  [["id", 1]]
---
  <strong>Line:</strong>
 <%= Line.find(@procedure_line.line_id).nombre %>