app/controllers/dependencies_controller.rb

   def index
    set_municipio(:municipio_id)
    @dependencies = Dependency.all
---
SELECT "dependencies".* FROM "dependencies"

  def new
    @dependency = Dependency.new
    @municipio = Municipio.all
---
SELECT "municipios".* FROM "municipios"

  def edit
    @municipio = Municipio.all
---
SELECT "municipios".* FROM "municipios"

  def create
    @dependency = Dependency.new(dependency_params)

    respond_to do |format|
      if @dependency.save
---
INSERT INTO "dependencies" ("created_at", "municipio_id", "nombre", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-12-07 19:25:52.181153"], ["municipio_id", 1], ["nombre", "DireccióndeDesarrolloMetropolitanoyEconómico"], ["updated_at", "2014-12-07 19:25:52.181153"]]

  def update
    respond_to do |format|
      if @dependency.update(dependency_params)
---
UPDATE "dependencies" SET "nombre" = ?, "updated_at" = ? WHERE "dependencies"."id" = 6  [["nombre", "Dirección de Desarrollo Metropolitano y Económico"], ["updated_at", "2014-12-09 17:19:31.991009"]]

  def destroy
    @dependency.destroy
---
DELETE FROM "dependencies" WHERE "dependencies"."id" = ?  [["id", 1]]

      def set_dependency
        @dependency = Dependency.find(params[:id])
---
SELECT  "dependencies".* FROM "dependencies"  WHERE "dependencies"."id" = ? LIMIT 1  [["id", 4]]

      def set_municipio(val)
        @municipio = Municipio.find(params[val])
---
SELECT  "municipios".* FROM "municipios"  WHERE "municipios"."id" = ? LIMIT 1  [["id", 1]]