app/controllers/imcos_controller.rb

SELECT  "municipios".* FROM "municipios"  WHERE "municipios"."id" = ? LIMIT 1  [["id", 1]]
---
def tramite
   @titulo = Municipio.find($id_del_municipio).nombre