app/controllers/imcos_controller.rb

SELECT "municipios".* FROM "municipios"
---
  def index
    @municipios = Municipio.all