app/controllers/inspectors_controller.rb

SELECT "inspectors".* FROM "inspectors"
---
  def index
    @inspectors = Inspector.all

SELECT "dependencies".* FROM "dependencies"
---
  def new
    @inspector = Inspector.new
    @dependency = Dependency.all

INSERT INTO "inspectors" ("contacto", "created_at", "dependency_id", "foto", "materia", "nombre", "supervisor", "updated_at", "vigencia") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @inspector = Inspector.new(inspector_params)

    respond_to do |format|
      if @inspector.save

UPDATE "inspectors" SET "contacto" = ?, "materia" = ?, "nombre" = ?, "supervisor" = ?, "updated_at" = ? WHERE "inspectors"."id" = 1
---
  def update
    respond_to do |format|
      if @inspector.update(inspector_params)

DELETE FROM "inspectors" WHERE "inspectors"."id" = ?  [["id", 2]]
---
  def destroy
    @inspector.destroy

SELECT  "inspectors".* FROM "inspectors"  WHERE "inspectors"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_inspector
      @inspector = Inspector.find(params[:id])