app/controllers/inspections_controller.rb

  def index
    @inspections = Inspection.all
---
SELECT "inspections".* FROM "inspections"

  def new
    @inspection = Inspection.new
    @dependency = Dependency.all
---
SELECT "dependencies".* FROM "dependencies"

  def edit
        @dependency = Dependency.all
---
SELECT "dependencies".* FROM "dependencies"

  def create
    @inspection = Inspection.new(inspection_params)

    respond_to do |format|
      if @inspection.save
---
INSERT INTO "inspections" ("antes", "created_at", "dependency_id", "despues", "duracion", "durante", "materia", "nombre", "norma", "sancion", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @inspection.update(inspection_params)
---
UPDATE "inspections" SET "duracion" = ?, "materia" = ?, "updated_at" = ? WHERE "inspections"."id" = 1  [["duracion", "15 MIN"], ["materia", "Desarrollo Metropolitano y Economico"], ["updated_at", "2014-12-09 19:06:57.792607"]]

  def destroy
    @inspection.destroy
---
DELETE FROM "inspections" WHERE "inspections"."id" = ?  [["id", 980190962]]

    def set_inspection
      @inspection = Inspection.find(params[:id])
---
SELECT  "inspections".* FROM "inspections"  WHERE "inspections"."id" = ? LIMIT 1  [["id", 980190962]]