app/controllers/inspection_lines_controller.rb

 def index
   @inspection_lines =  InspectionLine.all
---
SELECT "inspection_lines".* FROM "inspection_lines"

 def new
  @inspection_line = InspectionLine.new
  @inspection = Inspection.all
  @Line = Line.all
---
SELECT "inspections".* FROM "inspections"
SELECT "lines".* FROM "lines"

def edit
  @inspection = Inspection.all
  @line = Line.all
---
SELECT "inspections".* FROM "inspections"
SELECT "lines".* FROM "lines"

def create
  @inspection_line = InspectionLine.new(line_params)
  respond_to do |format|
    if @inspection_line.save
---
INSERT INTO "inspection_lines" ("created_at", "inspection_id", "line_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-12-08 18:04:16.494236"], ["inspection_id", 1], ["line_id", 1], ["updated_at", "2014-12-08 18:04:16.494236"]]

    def set_line
      @inspection_line = InspectionLine.find(params[:id])
---
SELECT  "inspection_lines".* FROM "inspection_lines"  WHERE "inspection_lines"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "lines".* FROM "lines"  WHERE "lines"."id" = ? LIMIT 1  [["id", 1]]