app/controllers/inspection_requirements_controller.rb

SELECT "procedure_requirements".* FROM "procedure_requirements"
---
 def index
   @procedure_requirements =  ProcedureRequirement.all