app/controllers/inspection_requirements_controller.rb

SELECT "inspection_requirements".* FROM "inspection_requirements"
---
 def index
   @inspection_requirements =  InspectionRequirement.all

SELECT "inspection_requirements".* FROM "inspection_requirements"
---
 def show
  @inspection_requirements=  InspectionRequirement.all

SELECT "inspections".* FROM "inspections"
SELECT "requirements".* FROM "requirements"
---
 def new
  @inspection_requirement = InspectionRequirement.new
  @inspection = Inspection.all
  @requirement = Requirement.all

SELECT "inspections".* FROM "inspections"
SELECT "requirements".* FROM "requirements"
---
def edit
@inspection = Inspection.all
  @requirement = Requirement.all

INSERT INTO "inspection_requirements" ("created_at", "inspection_id", "requirement_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-12-09 19:25:20.346446"], ["inspection_id", 1], ["requirement_id", 10], ["updated_at", "2014-12-09 19:25:20.346446"]]
---
def create
  @inspection_requirement = InspectionRequirement.new(line_params)
  respond_to do |format|
    if @inspection_requirement.save

UPDATE "inspection_requirements" SET "requirement_id" = ?, "updated_at" = ? WHERE "inspection_requirements"."id" = 3  [["requirement_id", 12], ["updated_at", "2014-12-09 19:53:57.966555"]]
---
def update
  respond_to do |format|
    if @inspection_requirement.update(line_params)

DELETE FROM "inspection_requirements" WHERE "inspection_requirements"."id" = ?  [["id", 3]]
---
def destroy
    @inspection_requirement.destroy

SELECT  "inspection_requirements".* FROM "inspection_requirements"  WHERE "inspection_requirements"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "requirements".* FROM "requirements"  WHERE "requirements"."id" = ? LIMIT 1  [["id", 10]]
---
    def set_line
      @inspection_requirement = InspectionRequirement.find(params[:id])