app/controllers/lines_controller.rb

  def index
    @lines = Line.all
---
SELECT "lines".* FROM "lines"

  def new
    @line = Line.new
     @municipio = Municipio.all
---
SELECT "municipios".* FROM "municipios"

  def create
    @line = Line.new(line_params)

    respond_to do |format|
      if @line.save
---
INSERT INTO "lines" ("created_at", "descripcion", "nombre", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-12-03 20:33:57.329531"], ["descripcion", "Música"], ["nombre", "ARTICULOS MAGNETOFONICOS Y MUSICALES"], ["updated_at", "2014-12-03 20:33:57.329531"]]

  def update
    respond_to do |format|
      if @line.update(line_params)
---
UPDATE "lines" SET "dependency_id" = ?, "updated_at" = ? WHERE "lines"."id" = 2  [["dependency_id", 3], ["updated_at", "2014-12-09 00:23:36.756420"]]

  def destroy
    @line.destroy
---
DELETE FROM "lines" WHERE "lines"."id" = ?  [["id", 1]]

    def set_line
      @line = Line.find(params[:id])
---
SELECT  "lines".* FROM "lines"  WHERE "lines"."id" = ? LIMIT 1  [["id", 2]]