app/controllers/municipios_controller.rb

  def index
    @municipios = Municipio.all
---
SELECT "municipios".* FROM "municipios"

  def create
    @municipio = Municipio.new(municipio_params)

    respond_to do |format|
      if @municipio.save
---
INSERT INTO "municipios" ("created_at", "nombre", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-12-02 23:50:37.048972"], ["nombre", "Chalco"], ["updated_at", "2014-12-02 23:50:37.048972"]]

  def update
    respond_to do |format|
      if @municipio.update(municipio_params)
---
UPDATE "municipios" SET "nombre" = ?, "updated_at" = ? WHERE "municipios"."id" = 5  [["nombre", "Tenango del Valle"], ["updated_at", "2014-12-03 18:03:58.623524"]]

  def destroy
    @municipio.destroy
---
DELETE FROM "municipios" WHERE "municipios"."id" = ?  [["id", 7]]

    def set_municipio(val)
      @municipio = Municipio.find(params[val])
---
SELECT  "municipios".* FROM "municipios"  WHERE "municipios"."id" = ? LIMIT 1  [["id", 7]]