app/controllers/procedure_lines_controller.rb

 def show
     set_municipio(:municipio_id)

    @procedure_requirements = ProcedureRequirement.all
    @procedure_lines=  ProcedureLine.all
    @requirements = Requirement.all
    @line = Line.find(@procedure_line.line_id).nombre
    @procedure = Procedure.find(@procedure_line.procedure_id).nombre
---
SELECT "procedure_lines".* FROM "procedure_lines"
SELECT  "lines".* FROM "lines"  WHERE "lines"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "procedures".* FROM "procedures"  WHERE "procedures"."id" = ? LIMIT 1  [["id", 2]]

 def new
  @procedure_line = ProcedureLine.new
  @procedure = Procedure.all
  @Line = Line.all
---
SELECT "procedures".* FROM "procedures"
SELECT "lines".* FROM "lines"

def edit
  @procedure = Procedure.all
  @line = Line.all
---
SELECT "procedures".* FROM "procedures"
SELECT "lines".* FROM "lines"

def create
  @procedure_line = ProcedureLine.new(line_params)
  respond_to do |format|
    if @procedure_line.save
---
INSERT INTO "procedure_lines" ("created_at", "line_id", "procedure_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-12-07 18:02:02.716643"], ["line_id", 1], ["procedure_id", 2], ["updated_at", "2014-12-07 18:02:02.716643"]]

def update
  respond_to do |format|
    if @procedure_line.update(line_params)
---
UPDATE "procedure_lines" SET "procedure_id" = ?, "updated_at" = ? WHERE "procedure_lines"."id" = 11  [["procedure_id", 3], ["updated_at", "2014-12-09 18:33:45.743381"]]

    def set_line
      @procedure_line = ProcedureLine.find(params[:id])
---
SELECT  "lines".* FROM "lines"  WHERE "lines"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "procedure_lines".* FROM "procedure_lines"  WHERE "procedure_lines"."id" = ? LIMIT 1  [["id", 11]]