app/controllers/procedure_requirements_controller.rb

 def index
   @procedure_requirements =  ProcedureRequirement.all
---
SELECT "procedure_requirements".* FROM "procedure_requirements"
SELECT "requirements".* FROM "requirements"

 def show
  @procedure_requirements =  ProcedureRequirement.all
    @procedure = Procedure.all
---
SELECT "procedure_requirements".* FROM "procedure_requirements"
SELECT "requirements".* FROM "requirements"
SELECT "procedures".* FROM "procedures"

 def new
  @procedure_requirement = ProcedureRequirement.new
  @procedure = Procedure.all
  @requirement = Requirement.all
---
SELECT "procedures".* FROM "procedures"
SELECT "requirements".* FROM "requirements"

def edit
  @procedure = Procedure.all
  @requirement = Requirement.all
---
SELECT "procedures".* FROM "procedures"
SELECT "requirements".* FROM "requirements"

def create
  @procedure_requirement = ProcedureRequirement.new(line_params)

  respond_to do |format|
    if @procedure_requirement.save
---
INSERT INTO "procedure_requirements" ("created_at", "procedure_id", "requirement_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-12-07 17:59:24.108386"], ["procedure_id", 2], ["requirement_id", 4], ["updated_at", "2014-12-07 17:59:24.108386"]]

def update
  respond_to do |format|
    if @procedure_requirement.update(line_params)
---
UPDATE "procedure_requirements" SET "requirement_id" = ?, "updated_at" = ? WHERE "procedure_requirements"."id" = 6  [["requirement_id", 7], ["updated_at", "2014-12-09 18:55:20.803650"]]

    def set_line
      @procedure_requirement = ProcedureRequirement.find(params[:id])
---
SELECT  "procedure_requirements".* FROM "procedure_requirements"  WHERE "procedure_requirements"."id" = ? LIMIT 1  [["id", 6]]
SELECT  "requirements".* FROM "requirements"  WHERE "requirements"."id" = ? LIMIT 1  [["id", 1]]