app/controllers/procedure_lines_controller.rb

SELECT "procedure_lines".* FROM "procedure_lines"
---
 def index
   @procedure_lines =  ProcedureLine.all