app/controllers/procedures_controller.rb

  def index
    @procedures = Procedure.all
---
SELECT "procedures".* FROM "procedures"

  def new
    @procedure = Procedure.new
    @dependency = Dependency.all
---
SELECT "dependencies".* FROM "dependencies"

  def edit
    @dependency = Dependency.all
---
SELECT "dependencies".* FROM "dependencies"

  def create
    @procedure = Procedure.new(procedure_params)

    respond_to do |format|
      if @procedure.save
---
INSERT INTO "procedures" ("contacto", "costo", "created_at", "dependency_id", "duracion", "nombre", "updated_at", "vigencia") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @procedure.update(procedure_params)
---
UPDATE "procedures" SET "dependency_id" = ?, "updated_at" = ? WHERE "procedures"."id" = 1  [["dependency_id", 4], ["updated_at", "2014-12-05 00:32:28.026106"]]

  def destroy
    @procedure.destroy
---
DELETE FROM "procedures" WHERE "procedures"."id" = ?  [["id", 980190962]]

    def set_procedure
      @procedure = Procedure.find(params[:id])
---
SELECT  "procedures".* FROM "procedures"  WHERE "procedures"."id" = ? LIMIT 1  [["id", 980190962]]