app/controllers/requirements_controller.rb

  def index
    @requirements = Requirement.all
---
SELECT "requirements".* FROM "requirements"

  def create
    @requirement = Requirement.new(requirement_params)

    respond_to do |format|
      if @requirement.save
---
INSERT INTO "requirements" ("created_at", "descripcion", "nombre", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-12-03 18:45:26.768199"], ["descripcion", "Credencial para votar con fotografia"], ["nombre", "INE"], ["updated_at", "2014-12-03 18:45:26.768199"]]

  def update
    respond_to do |format|
      if @requirement.update(requirement_params)
---
UPDATE "requirements" SET "descripcion" = ?, "updated_at" = ? WHERE "requirements"."id" = 1  [["descripcion", "copia"], ["updated_at", "2014-12-09 18:41:42.708033"]]

  def destroy
    @requirement.destroy
---
DELETE FROM "requirements" WHERE "requirements"."id" = ?  [["id", 980190962]]

    def set_requirement
      @requirement = Requirement.find(params[:id])
---
SELECT  "requirements".* FROM "requirements"  WHERE "requirements"."id" = ? LIMIT 1  [["id", 980190962]]