app/views/procedures/_form.html.erb

 <%= f.label :dependency %><br />
 <%= collection_select(:procedure, :dependency_id, Dependency.all, :id, :nombre, {:prompt => false}) %>
---
SELECT "dependencies".* FROM "dependencies"