app/views/inspection_requirements/_form.html.erb

  <%= f.label :inspection %><br>
  <%= collection_select(:inspection_requirement, :inspection_id, Inspection.all, :id, :nombre, {:prompt => false}) %>
---
SELECT "inspections".* FROM "inspections"
SELECT "requirements".* FROM "requirements"