app/views/inspection_requirements/index.html.erb

        <td>id: <%= procedure_requirement.id %></td>
        <td><%= Procedure.find(procedure_requirement.procedure_id).nombre %></td>
        <td><%= Requirement.find(procedure_requirement.line_id).nombre %></td>
---
SELECT  "procedures".* FROM "procedures"  WHERE "procedures"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "requirements".* FROM "requirements"  WHERE "requirements"."id" = ? LIMIT 1  [["id", 10]]