app/views/inspection_requirements/index.html.erb

        <td>id: <%= inspection_requirement.id %></td>
        <td><%= Inspection.find(inspection_requirement.inspection_id).nombre %></td>
---
SELECT  "inspections".* FROM "inspections"  WHERE "inspections"."id" = ? LIMIT 1  [["id", 1]]