app/views/inspection_requirements/show.html.erb

SELECT  "inspections".* FROM "inspections"  WHERE "inspections"."id" = ? LIMIT 1  [["id", 1]]
---
  <strong>Inspection:</strong>
  <%= Inspection.find(@inspection_requirement.inspection_id).nombre %>

SELECT  "requirements".* FROM "requirements"  WHERE "requirements"."id" = ? LIMIT 1  [["id", 10]]
---
  <strong>Requirement:</strong>
 <%= Requirement.find(@inspection_requirement.requirement_id).nombre %>