app/views/inspections/_form.html.erb

SELECT "dependencies".* FROM "dependencies"
---
 <%= f.label :dependencia %><br />
 <%= collection_select(:inspection, :dependency_id, Dependency.all, :id, :nombre, {:prompt => false}) %>